In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["John", "Anna", "Peter", "Linda"],
    "Age": [28, 34, 29, 32],
    "City": ["New York", "Paris", "Berlin", "London"],
}

In [6]:
df = pd.DataFrame(data)
df

    Name  Age      City
0   John   28  New York
1   Anna   34     Paris
2  Peter   29    Berlin
3  Linda   32    London

In [7]:
df["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [8]:
df["Name"].head(2)

0    John
1    Anna
Name: Name, dtype: object

In [9]:
import numpy as np

In [10]:
items = np.array(
    [
        " Apple",
        "banana ",
        "GRAPE",
        "cucumber",
        "Pineapple",
        " tomato ",
        "Orange",
        "Orange",
        " lemon",
        "Kiwi ",
        "mango",
        "blueberry ",
        " raspberry",
    ]
)

print(type(items))
print(type(items[0]))

<class 'numpy.ndarray'>
<class 'numpy.str_'>

In [11]:
hourly_visitors = np.array([468, 279, 73, 272, 406, 128, 302, 216, 140, 82])

print(type(hourly_visitors))
print(type(hourly_visitors[0]))

<class 'numpy.ndarray'>
<class 'numpy.int64'>

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [13]:
df.shape

(4, 3)

In [14]:
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [15]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [17]:
df.describe()

             Age
count   4.000000
mean   30.750000
std     2.753785
min    28.000000
25%    28.750000
50%    30.500000
75%    32.500000
max    34.000000

In [18]:
df.describe(include="all")

        Name        Age      City
count      4   4.000000         4
unique     4        NaN         4
top     John        NaN  New York
freq       1        NaN         1
mean     NaN  30.750000       NaN
std      NaN   2.753785       NaN
min      NaN  28.000000       NaN
25%      NaN  28.750000       NaN
50%      NaN  30.500000       NaN
75%      NaN  32.500000       NaN
max      NaN  34.000000       NaN

In [19]:
tip_df = pd.read_csv("./tips.csv")

In [20]:
tip_df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [21]:
tip_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [22]:
tip_df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [23]:
tip_df["smoker"].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

In [24]:
tip_df[["day", 'time', 'tip']]

      day    time   tip
0     Sun  Dinner  1.01
1     Sun  Dinner  1.66
2     Sun  Dinner  3.50
3     Sun  Dinner  3.31
4     Sun  Dinner  3.61
..    ...     ...   ...
239   Sat  Dinner  5.92
240   Sat  Dinner  2.00
241   Sat  Dinner  2.00
242   Sat  Dinner  1.75
243  Thur  Dinner  3.00

[244 rows x 3 columns]

In [25]:
tip_df['tip_per_person'] = tip_df["tip"]/tip_df["size"]

In [26]:
tip_df.head()

   total_bill   tip     sex smoker  day    time  size  tip_per_person
0       16.99  1.01  Female     No  Sun  Dinner     2        0.505000
1       10.34  1.66    Male     No  Sun  Dinner     3        0.553333
2       21.01  3.50    Male     No  Sun  Dinner     3        1.166667
3       23.68  3.31    Male     No  Sun  Dinner     2        1.655000
4       24.59  3.61  Female     No  Sun  Dinner     4        0.902500

In [27]:
tip_df["tip_percent"] = round((tip_df["tip"] / tip_df["total_bill"]) * 100, 2)

In [28]:
tip_df.head()

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68

In [29]:
tip_df.sort_values(by="tip_percent", ascending=False).head(5)

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
172,7.25,5.15,Male,Yes,Sun,Dinner,2,2.575,71.03
178,9.60,4.00,Female,Yes,Sun,Dinner,2,2.000,41.67
67,3.07,1.00,Female,Yes,Sat,Dinner,1,1.000,32.57
232,11.61,3.39,Male,No,Sat,Dinner,2,1.695,29.20
183,23.17,6.50,Male,Yes,Sun,Dinner,4,1.625,28.05

In [30]:
tip_df.sort_values(by="total_bill", ascending=False).head(5)

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
170,50.81,10.00,Male,Yes,Sat,Dinner,3,3.333333,19.68
212,48.33,9.00,Male,No,Sat,Dinner,4,2.250000,18.62
59,48.27,6.73,Male,No,Sat,Dinner,4,1.682500,13.94
156,48.17,5.00,Male,No,Sun,Dinner,6,0.833333,10.38
182,45.35,3.50,Male,Yes,Sun,Dinner,3,1.166667,7.72

In [31]:
tip_df[tip_df['day'] == 'Sun']

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68
...,...,...,...,...,...,...,...,...,...
186,20.90,3.50,Female,Yes,Sun,Dinner,3,1.166667,16.75
187,30.46,2.00,Male,Yes,Sun,Dinner,5,0.400000,6.57
188,18.15,3.50,Female,Yes,Sun,Dinner,3,1.166667,19.28
189,23.10,4.00,Male,Yes,Sun,Dinner,3,1.333333,17.32
190,15.69,1.50,Male,Yes,Sun,Dinner,2,0.750000,9.56

In [32]:
tip_df['day'].value_counts()

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [36]:
only_fri = tip_df[(tip_df["tip"] > 3) & (tip_df["day"] == 'Fri')]

In [38]:
only_fri.sort_values(by="tip", ascending=False).head()

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
95,40.17,4.73,Male,Yes,Fri,Dinner,4,1.1825,11.77
93,16.32,4.30,Female,Yes,Fri,Dinner,2,2.1500,26.35
96,27.28,4.00,Male,Yes,Fri,Dinner,2,2.0000,14.66
91,22.49,3.50,Male,No,Fri,Dinner,2,1.7500,15.56
221,13.42,3.48,Female,Yes,Fri,Lunch,2,1.7400,25.93

# Slicing

In [39]:
tip_df.tail()

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
239,29.03,5.92,Male,No,Sat,Dinner,3,1.973333,20.39
240,27.18,2.00,Female,Yes,Sat,Dinner,2,1.000000,7.36
241,22.67,2.00,Male,Yes,Sat,Dinner,2,1.000000,8.82
242,17.82,1.75,Male,No,Sat,Dinner,2,0.875000,9.82
243,18.78,3.00,Female,No,Thur,Dinner,2,1.500000,15.97

In [40]:
tip_df.head()

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68

In [42]:
tip_df.iloc[3]
tip_df.iloc[3:5]

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
3,23.68,3.31,Male,No,Sun,Dinner,2,1.6550,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.9025,14.68

In [47]:
tip_df.loc[3]
tip_df.loc[3:5, ['tip', 'size']]
tip_df.loc[3:5, "tip": "size"]

    tip     sex smoker  day    time  size
3  3.31    Male     No  Sun  Dinner     2
4  3.61  Female     No  Sun  Dinner     4
5  4.71    Male     No  Sun  Dinner     4

In [49]:
tip_df.sort_values(by='tip_percent', ascending=False)[tip_df['day'].isin(['Sat', 'Sun'])].iloc[5:]

C:\Users\E1009807\AppData\Local\Temp\ipykernel_7736\2594168256.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  tip_df.sort_values(by='tip_percent', ascending=False)[tip_df['day'].isin(['Sat', 'Sun'])].iloc[5:]

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
109,14.31,4.00,Female,Yes,Sat,Dinner,2,2.000000,27.95
51,10.29,2.60,Female,No,Sun,Dinner,2,1.300000,25.27
181,23.33,5.65,Male,Yes,Sun,Dinner,2,2.825000,24.22
185,20.69,5.00,Male,No,Sun,Dinner,5,1.000000,24.17
174,16.82,4.00,Male,Yes,Sun,Dinner,2,2.000000,23.78
...,...,...,...,...,...,...,...,...,...
187,30.46,2.00,Male,Yes,Sun,Dinner,5,0.400000,6.57
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
57,26.41,1.50,Female,No,Sat,Dinner,2,0.750000,5.68
102,44.30,2.50,Female,Yes,Sat,Dinner,3,0.833333,5.64
237,32.83,1.17,Male,Yes,Sat,Dinner,2,0.585000,3.56

In [50]:
tip_df.sort_values(by='tip', ascending=False)[(tip_df['day'] == "Thur")&(tip_df['size'] > 3) & (tip_df["time"] == "Lunch")].iloc[1:3]

C:\Users\E1009807\AppData\Local\Temp\ipykernel_7736\950029189.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  tip_df.sort_values(by='tip', ascending=False)[(tip_df['day'] == "Thur")&(tip_df['size'] > 3) & (tip_df["time"] == "Lunch")].iloc[1:3]

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
85,34.83,5.17,Female,No,Thur,Lunch,4,1.292500,14.84
143,27.05,5.00,Female,No,Thur,Lunch,6,0.833333,18.48

In [51]:
tip_df[
    (tip_df["day"] == "Thur") & (tip_df["time"] == "Lunch") & (tip_df["size"] > 3)
].sort_values(by="tip", ascending=False).iloc[1:3]

,total_bill,tip,sex,smoker,day,time,size,tip_per_person,tip_percent
85,34.83,5.17,Female,No,Thur,Lunch,4,1.2925,14.84
197,43.11,5.00,Female,Yes,Thur,Lunch,4,1.2500,11.60

# statistics
- mean, median, mode, sum, max, min

In [52]:
tip_df['tip'].mean()

np.float64(2.99827868852459)

In [54]:
tip_df.groupby('day')['total_bill'].mean()

day
Fri     17.151579
Sat     20.441379
Sun     21.410000
Thur    17.682742
Name: total_bill, dtype: float64

In [55]:
tip_df.groupby('smoker')['tip'].sum()

smoker
No     451.77
Yes    279.81
Name: tip, dtype: float64

In [56]:
tip_df.groupby("smoker")["tip"].mean()

smoker
No     2.991854
Yes    3.008710
Name: tip, dtype: float64

In [57]:
tip_df.groupby("smoker").aggregate({'tip':'mean'})

             tip
smoker
No      2.991854
Yes     3.008710

In [58]:
tip_df.groupby('smoker').aggregate({'tip':['mean', 'sum']})

             tip
            mean     sum
smoker
No      2.991854  451.77
Yes     3.008710  279.81

In [59]:
tip_df.groupby("smoker").aggregate({"tip": ["mean", "sum"], 'total_bill' : 'mean'})

             tip         total_bill
            mean     sum       mean
smoker
No      2.991854  451.77  19.188278
Yes     3.008710  279.81  20.756344

In [60]:
tip_df.groupby("smoker").aggregate(
    {"tip": ["mean", "sum"], "total_bill": ["mean", "sum"]}
)

             tip         total_bill
            mean     sum       mean      sum
smoker
No      2.991854  451.77  19.188278  2897.43
Yes     3.008710  279.81  20.756344  1930.34

In [61]:
tip_df.groupby('day').aggregate({'total_bill':'sum', 'tip_percent': 'mean'})

      total_bill  tip_percent
day
Fri       325.88    16.991579
Sat      1778.40    15.314598
Sun      1627.16    16.689605
Thur     1096.33    16.126452

In [62]:
tip_df.groupby('smoker')['tip'].mean()

smoker
No     2.991854
Yes    3.008710
Name: tip, dtype: float64

In [63]:
tip_df.groupby(["smoker", "day"])["tip"].mean()

smoker  day
No      Fri     2.812500
        Sat     3.102889
        Sun     3.167895
        Thur    2.673778
Yes     Fri     2.714000
        Sat     2.875476
        Sun     3.516842
        Thur    3.030000
Name: tip, dtype: float64

In [64]:
tip_df.groupby(["day", "smoker"])["tip"].mean()

day   smoker
Fri   No        2.812500
      Yes       2.714000
Sat   No        3.102889
      Yes       2.875476
Sun   No        3.167895
      Yes       3.516842
Thur  No        2.673778
      Yes       3.030000
Name: tip, dtype: float64

In [67]:
tip_df.groupby(['day', 'sex'])['tip'].sum()

day   sex
Fri   Female     25.03
      Male       26.93
Sat   Female     78.45
      Male      181.95
Sun   Female     60.61
      Male      186.78
Thur  Female     82.42
      Male       89.41
Name: tip, dtype: float64

In [68]:
tip_df.groupby(["day", "sex"])["tip"].sum().unstack()

sex   Female    Male
day
Fri    25.03   26.93
Sat    78.45  181.95
Sun    60.61  186.78
Thur   82.42   89.41